Documents/упЭтапПодбораПеревозчика.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Document>
		<Properties>
			<Name>упЭтапПодбораПеревозчика</Name>
			<Comment>{служебный документ}</Comment>
			<Posting>Deny</Posting>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ВидТранспорта</Name>
					<Type>
						<v8:Type>cfg:EnumRef.упВидыТранспорта</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Завершен</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЗавершенУспешно</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерЭтапа</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>3</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Отклонен</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Рейс</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.упРейс</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Тендер</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЭтапСхемыВыбораПеревозчика</Name>
					<Type>
						<v8:Type>cfg:EnumRef.упЭтапыСхемыВыбораПеревозчика</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Заявки</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ЗаявкаНаТС</Name>
							<Type>
								<v8:Type>cfg:DocumentRef.упЗаявкаНаТС</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

InformationRegisters/упСтатусыЗаявокНаТС.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>упСтатусыЗаявокНаТС</Name>
			<InformationRegisterPeriodicity>Second</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Статус</Name>
					<Type>
						<v8:Type>cfg:EnumRef.упСтатусыЗаявкиНаТС</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Документ</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.упЗаявкаНаТС</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Enums/упСтатусыЗаявкиНаТС.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>упСтатусыЗаявкиНаТС</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Создана</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Отправлена</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПолученоПредложение</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Подтверждена</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Отклонена</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Documents/упЗаявкаНаТС.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Document>
		<Properties>
			<Name>упЗаявкаНаТС</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>InformationRegister.упСтатусыЗаявокНаТС</xr:Item>
				<xr:Item>InformationRegister.упСтатусыРейсов</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>БеречьОтВлаги</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>БеречьОтИзлучения</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>БеречьОтНагрева</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Валюта</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЗапрещеноСкладироватьДругНаДруга</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КлассОпасности</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.упКлассыОпасности</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КоличествоЗагрузочныхМетров</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.КоличествоЗагрузочныхМетров</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КоличествоМест</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.КоличествоМест</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КонтрагентПеревозчика</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.упКонтрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>МаксимальнаяВысота</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ЛинейныеРазмеры</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>МаксимальнаяДлина</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ЛинейныеРазмеры</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>МаксимальнаяШирина</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ЛинейныеРазмеры</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Масса</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.Масса</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НачалоРейса</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Объем</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.Объем</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОкончаниеРейса</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОценочнаяСтоимость</Name>
					<Comment>Оценочная стоимость груза</Comment>
					<Type>
						<v8:TypeSet>cfg:DefinedType.Сумма</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Перевозчик</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.упПартнеры</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПравилоПодбораПеревозчиков</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.упПравилаПодбораПеревозчиковНаРейсы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Рейс</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.упРейс</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Соглашение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.упСоглашенияСПеревозчиками</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаРасходы</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.Сумма</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаРасходыНДС</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.Сумма</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТемпературныйРежим</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.упТемпературныеРежимы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Тендер</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипТС</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.упТипыТС</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТранспортноеСредство</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.упТранспортныеСредства</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Хрупкий</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЧасовойПояс</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.упЧасовыеПояса</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Этап</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.упЭтапПодбораПеревозчика</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Автор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ПлановыеРасходы</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>СтатьяРасходов</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.упСтатьиДоходовРасходов</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПравилоРаспределения</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.упПравилаРаспределенияРасходов</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Валюта</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Задание</Name>
							<Type>
								<v8:Type>cfg:DocumentRef.упЗаданиеНаПеревозкуГруза</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Цена</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.Сумма</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.КоличествоОпераций</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сумма</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.Сумма</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СтавкаНДС</Name>
							<Type>
								<v8:Type>cfg:EnumRef.упСтавкиНДС</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаНДС</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.Сумма</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ДополнительныеРеквизиты</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Свойство</Name>
							<Type>
								<v8:Type>cfg:ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.ДополнительныеРеквизитыИСведения</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТекстоваяСтрока</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

Catalogs/упСхемыВыбораПеревозчика.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>упСхемыВыбораПеревозчика</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Этапы</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Этап</Name>
							<Type>
								<v8:Type>cfg:EnumRef.упЭтапыСхемыВыбораПеревозчика</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВидТранспорта</Name>
							<Type>
								<v8:Type>cfg:EnumRef.упВидыТранспорта</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>РазыгрыватьТендер</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Documents/упЭтапПодбораПеревозчика/Forms/ФормаУправления/Ext/Form/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Рейс = Параметры.Рейс;
	ОбновитьДеревоЭтаповНаСервере();
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	РазвернутьДеревоНаКлиенте();	
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
		
	Если ИмяСобытия = "СменаСтатусаЗаявкиНаТС" Тогда
		
		ЭлементыДерева = ДеревоЭтапов.ПолучитьЭлементы();
		Для каждого текЭтап Из ЭлементыДерева Цикл
			ЭлементыИтерации = текЭтап.ПолучитьЭлементы();
			Для каждого текИтерация Из ЭлементыИтерации Цикл
				Если текИтерация.ЗаявкаНаТС = Источник Тогда
					ОбновитьДеревоЭтаповНаСервере();
					РазвернутьДеревоНаКлиенте();
					Возврат;
				КонецЕсли; 
			КонецЦикла; 
		КонецЦикла; 
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти 

#Область ОбработчикиСобытийЭлементовФормы

&НаКлиенте
Процедура ДеревоЭтаповВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	текСтрока = Элементы.ДеревоЭтапов.ТекущиеДанные;
	Если ЗначениеЗаполнено(текСтрока.ЗаявкаНаТС) Тогда
		ОткрытьФорму("Документ.упЗаявкаНаТС.ФормаОбъекта", Новый Структура("Ключ", текСтрока.ЗаявкаНаТС), ЭтаФорма,,,,, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	КонецЕсли;
	
КонецПроцедуры	

#КонецОбласти 

#Область ОбработчикиСобытийКоманд

&НаКлиенте
Процедура СвернутьДерево(Команда)
	
	ЭлементыДерева = ДеревоЭтапов.ПолучитьЭлементы();
	Для каждого текЭлемент Из ЭлементыДерева Цикл
		Элементы.ДеревоЭтапов.Свернуть(текЭлемент.ПолучитьИдентификатор());
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура РазвернутьДерево(Команда)
	
	РазвернутьДеревоНаКлиенте();
	
КонецПроцедуры

&НаКлиенте
Процедура ПерейтиКСледующейИтерации(Команда)
	
	ТекущийЭтап = ПолучитьТекущийЭтапНаСервере();
	Если ЗначениеЗаполнено(ТекущийЭтап) Тогда
		ЭтоТендер = упСервисныеФункцииВызовСервера.ЗначениеРеквизитаОбъекта(ТекущийЭтап, "Тендер");
		Если ЭтоТендер Тогда
			ТекстВопроса = НСтр("ru = 'Текущий этап является тендером, переход к следующей итерации по данному этапу невозможен. Перейти к следующему этапу (все заявки на ТС по нему будут отменены)?'");
			ПоказатьВопрос(Новый ОписаниеОповещения("ВопросПерейтиКСледующемуЭтапу", ЭтаФорма, Новый Структура("ТекущийЭтап", ТекущийЭтап)), ТекстВопроса, РежимДиалогаВопрос.ДаНет);
		Иначе
			ТекущаяИтерация = ПолучитьТекущуюИтерациюНаСервере();
			Если ЗначениеЗаполнено(ТекущаяИтерация) Тогда
				ТекстВопроса = НСтр("ru = 'Текущая итерация будет отклонена. Продолжить?'");
				ПоказатьВопрос(Новый ОписаниеОповещения("ВопросПерейтиКСледующейИтерации", ЭтаФорма, Новый Структура("ТекущаяИтерация", ТекущаяИтерация)), ТекстВопроса, РежимДиалогаВопрос.ДаНет);
			Иначе	
				ПерейтиКСледующейИтерацииНаСервере();
				РазвернутьДеревоНаКлиенте();
			КонецЕсли; 
		КонецЕсли; 
	Иначе
		ПроверитьСледующийЭтапНаТендер();	
		
	КонецЕсли; 
				
КонецПроцедуры

&НаКлиенте
Процедура ПерейтиКСледующемуЭтапу(Команда)
	
	ТекущийЭтап = ПолучитьТекущийЭтапНаСервере();
	
	Если ЗначениеЗаполнено(ТекущийЭтап) Тогда
		сткРеквизиты = упСервисныеФункцииВызовСервера.ЗначенияРеквизитовОбъекта(ТекущийЭтап, "Завершен, ЗавершенУспешно, Отклонен");
		Если Не сткРеквизиты.Отклонен И Не сткРеквизиты.Завершен И Не сткРеквизиты.ЗавершенУспешно Тогда
			ТекстВопроса = НСтр("ru = 'Текущий этап будет закрыт, и все заявки на ТС по нему будут отменены. Продолжить?'");
			ПоказатьВопрос(Новый ОписаниеОповещения("ВопросПерейтиКСледующемуЭтапу", ЭтаФорма, Новый Структура("ТекущийЭтап", ТекущийЭтап)), ТекстВопроса, РежимДиалогаВопрос.ДаНет);
		КонецЕсли; 
	Иначе
		ПроверитьСледующийЭтапНаТендер();	
	КонецЕсли; 
	
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьДеревоЭтапов(Команда)
	
	ОбновитьДеревоЭтаповНаСервере();
	РазвернутьДеревоНаКлиенте();
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура РазвернутьДеревоНаКлиенте()
	
	ЭлементыДерева = ДеревоЭтапов.ПолучитьЭлементы();
	Для каждого текЭлемент Из ЭлементыДерева Цикл
		Элементы.ДеревоЭтапов.Развернуть(текЭлемент.ПолучитьИдентификатор());
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Функция ОпределитьСледующийЭтап()
	
	СледующийЭтап = Неопределено;
	
	ЭлементыЭтапы = ДеревоЭтапов.ПолучитьЭлементы();
	Для каждого текЭтап Из ЭлементыЭтапы Цикл
		Если Не ЗначениеЗаполнено(текЭтап.Этап) Тогда
			СледующийЭтап = текЭтап;
			Прервать;
		КонецЕсли; 
	КонецЦикла;
	
	Возврат СледующийЭтап;

КонецФункции

&НаКлиенте
Процедура ПроверитьСледующийЭтапНаТендер()
	
	СледующийЭтап = ОпределитьСледующийЭтап();
	Если СледующийЭтап = Неопределено Тогда
		Возврат;
	Иначе	
		Если СледующийЭтап.Тендер Тогда
			МассивПеревозчиков = ПолучитьМассивПеревозчиков(Рейс, СледующийЭтап.ЭтапСхемыВыбораПеревозчика, Истина, СледующийЭтап.ВидТранспорта);
			Если МассивПеревозчиков.Количество() Тогда
				
				СписокПеревозчиков = Новый СписокЗначений;
				СписокПеревозчиков.ЗагрузитьЗначения(МассивПеревозчиков);
				
				сткПараметры = Новый Структура;
				сткПараметры.Вставить("КлючУникальности", УникальныйИдентификатор);
				сткПараметры.Вставить("Представление", НСтр("ru = 'участников тендера'"));
				сткПараметры.Вставить("ОграничиватьВыборУказаннымиЗначениями", Истина);
				сткПараметры.Вставить("ЗначенияДляВыбора", СписокПеревозчиков);
				
				сткПараметры.Вставить("Отмеченные"   , СписокПеревозчиков);
				сткПараметры.Вставить("ОписаниеТипов", Новый ОписаниеТипов("СправочникСсылка.упПартнеры"));
				ОткрытьФорму("ОбщаяФорма.ВводЗначенийСпискомСФлажками", сткПараметры, ЭтотОбъект,,,, Новый ОписаниеОповещения("ВыборПеревозчиковДляТендераЗавершение", ЭтаФорма), РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
			Иначе	
				ПерейтиКСледующемуЭтапуНаСервере();
				РазвернутьДеревоНаКлиенте();
			КонецЕсли; 
			
		Иначе
			ПерейтиКСледующемуЭтапуНаСервере();
			РазвернутьДеревоНаКлиенте();
		КонецЕсли; 
	КонецЕсли; 
	
КонецПроцедуры		

&НаСервере
Функция ПолучитьМассивПеревозчиков(Рейс, ЭтапСхемы, ЭтоТендер, ВидТранспорта)
	
	Возврат Документы.упЭтапПодбораПеревозчика.ПодобратьПеревозчиков(Рейс, ЭтапСхемы, ЭтоТендер,, ВидТранспорта).ВыгрузитьКолонку("Перевозчик");
	
КонецФункции

&НаСервере
Функция ПолучитьТекущийЭтапНаСервере()
	
	Возврат Документы.упЭтапПодбораПеревозчика.ПолучитьТекущийЭтап(Рейс);
	
КонецФункции

&НаСервере
Функция ПолучитьТекущуюИтерациюНаСервере()
	
	ТекущаяИтерация = Документы.упЭтапПодбораПеревозчика.ПолучитьТекущуюИтерацию(Рейс);
	Если ЗначениеЗаполнено(ТекущаяИтерация) Тогда
		Статус = Документы.упЗаявкаНаТС.ПолучитьСтатус(ТекущаяИтерация);
		Если Статус = Перечисления.упСтатусыЗаявкиНаТС.Отклонена Или Статус = Перечисления.упСтатусыЗаявкиНаТС.Подтверждена Тогда
			ТекущаяИтерация = Неопределено;
		КонецЕсли; 
	КонецЕсли; 
	
	Возврат ТекущаяИтерация;
	
КонецФункции

&НаСервере
Процедура ОбновитьДеревоЭтаповНаСервере()
	
	ДеревоЭтапов.ПолучитьЭлементы().Очистить();
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	упРейс.Ссылка КАК Рейс,
	|	упРейс.ВидПеревозки.СхемаВыбораПеревозчика КАК СхемаВыбораПеревозчика
	|ПОМЕСТИТЬ втРейс
	|ИЗ
	|	Документ.упРейс КАК упРейс
	|ГДЕ
	|	упРейс.Ссылка = &Рейс
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	упЭтапы.НомерСтроки КАК НомерЭтапа,
	|	упЭтапы.Этап КАК ЭтапСхемыВыбораПеревозчика,
	|	упЭтапы.РазыгрыватьТендер КАК Тендер,
	|	упЭтапы.ВидТранспорта
	|ПОМЕСТИТЬ втВозможныеЭтапы
	|ИЗ
	|	Справочник.упСхемыВыбораПеревозчика.Этапы КАК упЭтапы
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ втРейс КАК втРейс
	|		ПО упЭтапы.Ссылка = втРейс.СхемаВыбораПеревозчика
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	упЭтапПодбораПеревозчика.НомерЭтапа,
	|	упЭтапПодбораПеревозчика.Ссылка КАК Этап,
	|	упЭтапПодбораПеревозчика.Завершен,
	|	упЭтапПодбораПеревозчика.ЗавершенУспешно,
	|	упЭтапПодбораПеревозчика.Отклонен,
	|	упЭтапПодбораПеревозчика.Тендер,
	|	упЭтапПодбораПеревозчика.ВидТранспорта,
	|	упЭтапПодбораПеревозчика.ЭтапСхемыВыбораПеревозчика
	|ПОМЕСТИТЬ втТекущиеЭтапы
	|ИЗ
	|	Документ.упЭтапПодбораПеревозчика КАК упЭтапПодбораПеревозчика
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ втРейс КАК втРейс
	|		ПО упЭтапПодбораПеревозчика.Рейс = втРейс.Рейс
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	втТекущиеЭтапы.Этап,
	|	упЗаявки.НомерСтроки КАК Итерация,
	|	упЗаявки.ЗаявкаНаТС КАК ЗаявкаНаТС
	|ПОМЕСТИТЬ втИтерацииПоЭтапам
	|ИЗ
	|	втТекущиеЭтапы КАК втТекущиеЭтапы
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.упЭтапПодбораПеревозчика.Заявки КАК упЗаявки
	|		ПО втТекущиеЭтапы.Этап = упЗаявки.Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	упСтатусыЗаявокНаТССрезПоследних.Документ КАК ЗаявкаНаТС,
	|	упСтатусыЗаявокНаТССрезПоследних.Статус
	|ПОМЕСТИТЬ втСтатусыЗаявок
	|ИЗ
	|	РегистрСведений.упСтатусыЗаявокНаТС.СрезПоследних(
	|			,
	|			Документ В
	|				(ВЫБРАТЬ
	|					втИтерацииПоЭтапам.ЗаявкаНаТС
	|				ИЗ
	|					втИтерацииПоЭтапам)) КАК упСтатусыЗаявокНаТССрезПоследних
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	втВозможныеЭтапы.НомерЭтапа,
	|	ЕСТЬNULL(втТекущиеЭтапы.Этап, ЗНАЧЕНИЕ(Документ.упЭтапПодбораПеревозчика.ПустаяСсылка)) КАК Этап,
	|	ЕСТЬNULL(втТекущиеЭтапы.Завершен, ЛОЖЬ) КАК Завершен,
	|	ЕСТЬNULL(втТекущиеЭтапы.ЗавершенУспешно, ЛОЖЬ) КАК ЗавершенУспешно,
	|	ЕСТЬNULL(втТекущиеЭтапы.Отклонен, ЛОЖЬ) КАК Отклонен,
	|	ЕСТЬNULL(втТекущиеЭтапы.Тендер, втВозможныеЭтапы.Тендер) КАК Тендер,
	|	ЕСТЬNULL(втТекущиеЭтапы.ВидТранспорта, втВозможныеЭтапы.ВидТранспорта) КАК ВидТранспорта,
	|	ВЫБОР
	|		КОГДА втТекущиеЭтапы.Завершен ЕСТЬ NULL 
	|			ТОГДА 4
	|		КОГДА ЕСТЬNULL(втТекущиеЭтапы.Отклонен, ЛОЖЬ)
	|			ТОГДА 1
	|		КОГДА ЕСТЬNULL(втТекущиеЭтапы.Завершен, ЛОЖЬ)
	|			ТОГДА 2
	|		КОГДА ЕСТЬNULL(втТекущиеЭтапы.ЗавершенУспешно, ЛОЖЬ)
	|			ТОГДА 3
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК ИндексКартинки,
	|	ЕСТЬNULL(втТекущиеЭтапы.ЭтапСхемыВыбораПеревозчика, втВозможныеЭтапы.ЭтапСхемыВыбораПеревозчика) КАК ЭтапСхемыВыбораПеревозчика,
	|	ПРЕДСТАВЛЕНИЕССЫЛКИ(ЕСТЬNULL(втТекущиеЭтапы.ЭтапСхемыВыбораПеревозчика, втВозможныеЭтапы.ЭтапСхемыВыбораПеревозчика)) КАК ПредставлениеЭтапа
	|ИЗ
	|	втВозможныеЭтапы КАК втВозможныеЭтапы
	|		ЛЕВОЕ СОЕДИНЕНИЕ втТекущиеЭтапы КАК втТекущиеЭтапы
	|		ПО втВозможныеЭтапы.НомерЭтапа = втТекущиеЭтапы.НомерЭтапа
	|
	|УПОРЯДОЧИТЬ ПО
	|	втВозможныеЭтапы.НомерЭтапа
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	втИтерацииПоЭтапам.Этап,
	|	втИтерацииПоЭтапам.Итерация,
	|	втИтерацииПоЭтапам.ЗаявкаНаТС,
	|	втИтерацииПоЭтапам.ЗаявкаНаТС.Перевозчик КАК Перевозчик,
	|	ПРЕДСТАВЛЕНИЕССЫЛКИ(втИтерацииПоЭтапам.ЗаявкаНаТС.Перевозчик) КАК ПредставлениеПеревозчика,
	|	ЕСТЬNULL(втСтатусыЗаявок.Статус, ЗНАЧЕНИЕ(Перечисление.упСтатусыЗаявкиНаТС.Создана)) КАК Статус,
	|	ВЫБОР
	|		КОГДА втСтатусыЗаявок.Статус ЕСТЬ NULL 
	|			ТОГДА 0
	|		КОГДА втСтатусыЗаявок.Статус = ЗНАЧЕНИЕ(Перечисление.упСтатусыЗаявкиНаТС.Создана)
	|			ТОГДА 0
	|		КОГДА втСтатусыЗаявок.Статус = ЗНАЧЕНИЕ(Перечисление.упСтатусыЗаявкиНаТС.Отклонена)
	|			ТОГДА 1
	|		ИНАЧЕ втСтатусыЗаявок.Статус.Порядок + 4
	|	КОНЕЦ КАК ИндексКартинки,
	|	ПРЕДСТАВЛЕНИЕССЫЛКИ(ЕСТЬNULL(втСтатусыЗаявок.Статус, ЗНАЧЕНИЕ(Перечисление.упСтатусыЗаявкиНаТС.Создана))) КАК ПредставлениеСтатуса
	|ИЗ
	|	втИтерацииПоЭтапам КАК втИтерацииПоЭтапам
	|		ЛЕВОЕ СОЕДИНЕНИЕ втСтатусыЗаявок КАК втСтатусыЗаявок
	|		ПО втИтерацииПоЭтапам.ЗаявкаНаТС = втСтатусыЗаявок.ЗаявкаНаТС";
	Запрос.УстановитьПараметр("Рейс", Рейс);
	Результат = Запрос.ВыполнитьПакет();
	КоличествоТаблиц = Результат.Количество();
	Если Не Результат[КоличествоТаблиц - 2].Пустой()  Тогда
		тзЭтапы    = Результат[КоличествоТаблиц - 2].Выгрузить();
		тзИтерации = Результат[КоличествоТаблиц - 1].Выгрузить();
		
		ЭлементыДерева = ДеревоЭтапов.ПолучитьЭлементы();
		Для каждого текЭтап Из тзЭтапы Цикл
			НовыйЭтап = ЭлементыДерева.Добавить();
			НовыйЭтап.Представление = НСтр(СтрШаблон("ru = 'Этап %1. %2'", Строка(текЭтап.НомерЭтапа), текЭтап.ПредставлениеЭтапа));
			ЗаполнитьЗначенияСвойств(НовыйЭтап, текЭтап);
			
			тзЗаявкиПоЭтапу = тзИтерации.Скопировать(Новый Структура("Этап", текЭтап.Этап));
			Если тзЗаявкиПоЭтапу.Количество() Тогда
				тзЗаявкиПоЭтапу.Сортировать("Итерация");
				ЭлементыИтерации = НовыйЭтап.ПолучитьЭлементы();
				Для каждого текИтерация Из тзЗаявкиПоЭтапу Цикл
					НоваяИтерация = ЭлементыИтерации.Добавить();
					Если НовыйЭтап.Тендер Тогда
						НоваяИтерация.Представление = НСтр(СтрШаблон("ru = 'Заявка перевозчику ""%1"" (%2)'", текИтерация.ПредставлениеПеревозчика, текИтерация.ПредставлениеСтатуса));
					Иначе
						НоваяИтерация.Представление = НСтр(СтрШаблон("ru = 'Итерация %1. Заявка перевозчику ""%2"" (%3)'", Строка(текИтерация.Итерация),  текИтерация.ПредставлениеПеревозчика, текИтерация.ПредставлениеСтатуса));
					КонецЕсли; 
					ЗаполнитьЗначенияСвойств(НоваяИтерация, текИтерация);
				КонецЦикла; 
			КонецЕсли; 

		КонецЦикла;
	КонецЕсли; 
	
КонецПроцедуры

&НаСервере
Процедура ПерейтиКСледующейИтерацииНаСервере(ТекущаяИтерация = Неопределено)
	
	ТекстОшибки = "";
	Отказ = Ложь;
	Документы.упЭтапПодбораПеревозчика.ПерейтиКСледующейИтерации(Рейс, ТекущаяИтерация,, ТекстОшибки, Отказ);
	Если Отказ Тогда
		Если ЗначениеЗаполнено(ТекстОшибки) Тогда
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстОшибки);
		КонецЕсли; 
	Иначе	
		ОбновитьДеревоЭтаповНаСервере();
	КонецЕсли; 
	
КонецПроцедуры

&НаСервере
Процедура ПерейтиКСледующемуЭтапуНаСервере(ТекущийЭтап = Неопределено, СписокПеревозчиков = Неопределено)
	
	ТекстОшибки = "";
	Отказ = Ложь;
	Документы.упЭтапПодбораПеревозчика.ПерейтиКСледующемуЭтапу(Рейс, ТекущийЭтап, СписокПеревозчиков, ТекстОшибки, Отказ);
	Если Отказ Тогда
		Если ЗначениеЗаполнено(ТекстОшибки) Тогда
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстОшибки);
			ОбновитьДеревоЭтаповНаСервере();
		КонецЕсли; 
	Иначе	
		ОбновитьДеревоЭтаповНаСервере();
	КонецЕсли; 
	
КонецПроцедуры

#Область ОповещенияПоСобытиям

&НаКлиенте
// Продолжение процедуры (см. выше).
Процедура ВопросПерейтиКСледующемуЭтапу(Ответ, ДополнительныеПараметры) Экспорт
	
	Если Ответ = КодВозвратаДиалога.Да Тогда
		ПерейтиКСледующемуЭтапуНаСервере(ДополнительныеПараметры.ТекущийЭтап);
		РазвернутьДеревоНаКлиенте();
	КонецЕсли; 
	
КонецПроцедуры

&НаКлиенте
// Продолжение процедуры (см. выше).
Процедура ВопросПерейтиКСледующейИтерации(Ответ, ДополнительныеПараметры) Экспорт
	
	Если Ответ = КодВозвратаДиалога.Да Тогда
		ПерейтиКСледующейИтерацииНаСервере(ДополнительныеПараметры.ТекущаяИтерация);
		РазвернутьДеревоНаКлиенте();
	КонецЕсли; 
	
КонецПроцедуры

&НаКлиенте
// Процедура завершения после выбора перевозчика из списка.
//
Процедура ВыборПеревозчиковДляТендераЗавершение(Ответ, ДополнительныеПараметры) Экспорт
	
	Если ТипЗнч(Ответ) = Тип("СписокЗначений") Тогда
		СписокПеревозчиков = Новый СписокЗначений;
		Для каждого текЗначение Из Ответ Цикл
			Если текЗначение.Пометка Тогда
				СписокПеревозчиков.Добавить(текЗначение.Значение);
			КонецЕсли; 
		КонецЦикла; 
		
		Если СписокПеревозчиков.Количество() Тогда
			ПерейтиКСледующемуЭтапуНаСервере(, СписокПеревозчиков);
			РазвернутьДеревоНаКлиенте();
		КонецЕсли; 
	КонецЕсли; 
	
КонецПроцедуры

#КонецОбласти

#КонецОбласти
